Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
F (InputLayer)                  [(None, 3, 3)]       0                                            
__________________________________________________________________________________________________
tf_op_layer_Shape_1 (TensorFlow [(3,)]               0           F[0][0]                          
__________________________________________________________________________________________________
tf_op_layer_strided_slice_1 (Te [()]                 0           tf_op_layer_Shape_1[0][0]        
__________________________________________________________________________________________________
tf_op_layer_ones_1/packed (Tens [(3,)]               0           tf_op_layer_strided_slice_1[0][0]
__________________________________________________________________________________________________
tf_op_layer_ones_1 (TensorFlowO [(None, 1, 1)]       0           tf_op_layer_ones_1/packed[0][0]  
__________________________________________________________________________________________________
F_isoRef (Lambda)               (None, None, None)   0           F[0][0]                          
__________________________________________________________________________________________________
C (Lambda)                      (None, 3, 3)         0           F[0][0]                          
__________________________________________________________________________________________________
H (Lambda)                      (None, 1, 3, 3)      0           tf_op_layer_ones_1[0][0]         
__________________________________________________________________________________________________
C_isoRef (Lambda)               (None, None, None)   0           F_isoRef[0][0]                   
__________________________________________________________________________________________________
invariants_I (Lambda)           (None, 1)            0           C[0][0]                          
                                                                 H[0][0]                          
__________________________________________________________________________________________________
invariants_J (Lambda)           (None, 1)            0           C[0][0]                          
                                                                 H[0][0]                          
__________________________________________________________________________________________________
invariant_III_C (Lambda)        (None, 1)            0           C[0][0]                          
__________________________________________________________________________________________________
invariants_I_isoRef (Lambda)    (None, 1)            0           C_isoRef[0][0]                   
                                                                 H[0][0]                          
__________________________________________________________________________________________________
invariants_J_isoRef (Lambda)    (None, 1)            0           C_isoRef[0][0]                   
                                                                 H[0][0]                          
__________________________________________________________________________________________________
invariant_III_C_isoRef (Lambda) (None, 1)            0           C_isoRef[0][0]                   
__________________________________________________________________________________________________
Psi (Model)                     (None, 1)            192         invariants_I[0][0]               
                                                                 invariants_J[0][0]               
                                                                 invariant_III_C[0][0]            
                                                                 invariants_I_isoRef[0][0]        
                                                                 invariants_J_isoRef[0][0]        
                                                                 invariant_III_C_isoRef[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Sub_1 (TensorFlowOp [(None, 1)]          0           Psi[1][0]                        
                                                                 Psi[2][0]                        
__________________________________________________________________________________________________
P_isoRef (Lambda)               (None, None, None)   0           Psi[2][0]                        
                                                                 F_isoRef[0][0]                   
__________________________________________________________________________________________________
P_iso (Lambda)                  (None, 3, 3)         0           tf_op_layer_Sub_1[0][0]          
                                                                 F[0][0]                          
__________________________________________________________________________________________________
lagMul (Lambda)                 (None, 1)            0           P_isoRef[0][0]                   
__________________________________________________________________________________________________
P (Lambda)                      (None, 3, 3)         0           P_iso[0][0]                      
                                                                 F[0][0]                          
                                                                 lagMul[0][0]                     
__________________________________________________________________________________________________
J (Lambda)                      (None, 1)            0           F[0][0]                          
__________________________________________________________________________________________________
S (Lambda)                      (None, 3, 3)         0           P[0][0]                          
                                                                 F[0][0]                          
__________________________________________________________________________________________________
sigma (Lambda)                  (None, 3, 3)         0           P[0][0]                          
                                                                 F[0][0]                          
                                                                 J[0][0]                          
==================================================================================================
Total params: 192
Trainable params: 192
Non-trainable params: 0
__________________________________________________________________________________________________
